<a href="https://colab.research.google.com/github/sharvariK-11/ML-algorithm/blob/main/linear_regression_pynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import numpy as np
import pandas as pd

data=pd.read_csv('/content/drive/MyDrive/SoC LD/SoC.csv')  ##read a file in pandas
data.head(10)                                                   ##see file like this

   Unnamed: 0  area       prices
0           0  1000  316404.1096
1           1  1500  384297.9452
2           2  2300  492928.0822
3           3  3540  661304.7945
4           4  4120  740061.6438
5           5  4560  799808.2192
6           6  5490  926090.7534
7           7  3460  650441.7808
8           8  4750  825607.8767
9           9  2300  492928.0822

In [8]:
data.iloc[0]

Unnamed: 0         0.0000
area            1000.0000
prices        316404.1096
Name: 0, dtype: float64

iloc[r] gives specifications of row r

In [ ]:
data.loc[0:3]  ##gives rows from 0 to 3

   Unnamed: 0  area       prices
0           0  1000  316404.1096
1           1  1500  384297.9452
2           2  2300  492928.0822
3           3  3540  661304.7945

In [ ]:
x=data.drop(['prices'], axis=1)
x.head()

   Unnamed: 0  area
0           0  1000
1           1  1500
2           2  2300
3           3  3540
4           4  4120

In [ ]:
y=data['prices']
y.head()                  ##by default head() implies initial 5 rows total

0    316404.1096
1    384297.9452
2    492928.0822
3    661304.7945
4    740061.6438
Name: prices, dtype: float64

###axis=1 means columns, axis=0 means rows